//2.10
#include<iostream>
using namespace std;
int task2()
{

    return 0;
}
/*
Створити тип даних - клас множина з повторенням діапазону цілих чисел.
У класі визначити вказівник на unsigned int(для збереження множини), числа beg (початок) та end(кінець) діапазону типу unsigned int (beg<end) і змінну стану.
У множині створюється масив розміром size = end - beg, який кількість повторень елемента множини.

У класі визначити:
o конструктор без параметрів(виділяє місце для множини чисел beg = 0 до end =100 та інінціалізує його в нуль);
o конструктор з одним параметром - end (beg = 0, виділяє місце та інінціалізує масив значенням нуль);
o конструктор із двома параметрами beg та end (виділяє місце та інінціалізує масив значенням нуль);
o конструктор із трьома параметрами beg, end та value(виділяє місце та інінціалізує масив значенням value);
o конструктор копій та операцію присвоєння; // !!!
o деструктор звільняє пам'ять;
o визначити функцію, яка присвоює елементу множини деяке значення value (параметр за замовчуванням);
o функцію яка одержує кількість повторення елементу множини;
o визначити функції друку, об’єднання, перетину та різниці, які здійснюють ці арифметичні операції з даними цього класу;
o визначити функції порівняння: більше, менше, нерівно або рівно, які повертають true або false.

У змінну стани встановлювати код помилки, коли не вистачає пам'яті, виходить за межі множини, ініціалізація числом, яке є за межами діапазону множини.
Передбачити можливість підрахунку числа об'єктів даного типу. Написати програму тестування всіх можливостей цього класу.
*/