//3.2 not started
int task3()
{
    return 0;
}
/*
Створити клас матриця.
Даний клас містить вказівник на float, розміри рядків і стовпців та стан помилки.

У класі визначити:
o конструктор без параметрів( виділяє місце для матриці 2 на 2 елемента та інінціалізує його в нуль);
o конструктор з одним параметром - розмір n матриці (виділяє місце для матриці n на n та інінціалізує матрицю значенням нуль);
o конструктор із трьома розміри матриці (n , m) та значення ініціалізації value (виділяє місце перші аргументи та інінціалізує значенням третього аргументу - value);
o конструктор копій та операцію присвоєння; // !!!
o деструктор звільняє пам'ять.
o визначити функцію, яка присвоює елементу масиву деяке значення (параметр за замовчуванням);
o функцію яка одержує деякий елемент матриці за індексами i та j;
o визначити функції друку, додавання, множення на скаляр, віднімання, які здійснюють ці арифметичні операції з даними цього класу;
o визначити функції порівняння: більше, менше або рівно, які повертають true або false.

У змінну стани встановлювати код помилки, коли не вистачає пам'яті, виходить за межі матриці.
Передбачити можливість підрахунку числа об'єктів даного типу.
Написати програму тестування всіх можливостей цього класу.
*/